after/app/controllers/authors_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT 1  [["id", 2]]
---
  def show
    @book_facade = BookFacade.new(Author.find(params[:id]))